Show / Hide Table of Contents
Class FemElement
Provides information about FEM element
Inheritance
System.Object
FemElement
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class FemElement
Constructors
Improve this Doc   View Source
FemElement()
Constructor
Declaration
public FemElement()
Improve this Doc   View Source
FemElement(Int32, Int32, Int32)
Constructor for triangular element 2d
Declaration
public FemElement(int node1, int node2, int node3)
Parameters
 Type |  Name |  Description
 System.Int32 |  node1
 System.Int32 |  node2
 System.Int32 |  node3
Improve this Doc   View Source
FemElement(Int32, Int32, Int32, Int32)
Constructor for quadrilateral element 2D
Declaration
public FemElement(int node1, int node2, int node3, int node4)
Parameters
 Type |  Name |  Description
 System.Int32 |  node1
 System.Int32 |  node2
 System.Int32 |  node3
 System.Int32 |  node4
Properties
Improve this Doc   View Source
Type
Type of the finite element 1 - triangular element 2D 2 - quadrilateral element 2D
Declaration
[DataMember]
public int Type { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Vertices
Get list of vertices of the fem element
Declaration
[DataMember]
public List<int> Vertices { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Int32>
 Improve this Doc
 View Source